html/20231128T130129--alpine-installation__alpine_linux.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>alpine installation</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">14 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231128T130129--alpine-installation__alpine_linux.html">alpine installation</a></h1>
<p>
Decided to install alpine(again) and see what it's all about. Started with <a href="https://www.youtube.com/watch?v=E7zJTzf0pWA&amp;ab_channel=ProgrammerGuide">this</a>
tutorial.
</p>

<p>
INSTALLATION GUIDE
</p>

<ul class="org-ul">
<li>install virtual machine with 1gb and 10gb</li>
<li>ping google.com for internet connection</li>
<li>apk add sudo (might not need this, just enable community first)</li>
<li>sudo apk add htop</li>
<li>vi /etc/apk/repositories - enable community one</li>
<li>apk update</li>
<li>sudo apk add emacs</li>
</ul>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-alpine.html">alpine</a> <a href="https://arvydasg.github.io/devnotes/html/tag-linux.html">linux</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
